pde_tutorial/d2_xnitsche.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Interface problem with XFEM (incl. pde/python)</title>
<!-- 2015-02-15 So 22:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Christoph Lehrenfeld" />
<link rel="stylesheet" type="text/css" href="media/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Interface problem with XFEM (incl. pde/python)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Description of the considered example</a></li>
<li><a href="#sec-2">2. Description and Explaination of the pde-file</a>
<ul>
<li><a href="#sec-2-1">2.1. Geometry, mesh and libraries</a></li>
<li><a href="#sec-2-2">2.2. Constants, solutions and level set function</a></li>
<li><a href="#sec-2-3">2.3. (Extended) Finite element space and Gridfunction</a></li>
<li><a href="#sec-2-4">2.4. Gridfunction, linear and bilinear forms</a></li>
<li><a href="#sec-2-5">2.5. Solver and Visualization</a></li>
<li><a href="#sec-2-6">2.6. Things to try with the pde-file here:</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Resulting files</a></li>
</ul>
</div>
</div>
<hr  />

<p>
This document is under construction &#x2026;
</p>

<p>
We explain a simple interface example.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Description of the considered example</h2>
<div class="outline-text-2" id="text-1">
<p>
We consider the solution of an interface problem.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Description and Explaination of the pde-file</h2>
<div class="outline-text-2" id="text-2">
<p>
Many things are very similar to the example <a href="d1_approx.pde">d2_approx.pde</a>. We thus only discuss new aspects. 
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Geometry, mesh and libraries</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In the NGSolve pde-file the components for setting up the problem is defined. 
First, a geometry and a mesh is loaded. Afterwards additional libraries are loaded.
</p>
<div class="org-src-container">

<pre class="src src-pde" id="mesh"><span class="linenr"> 1: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">load geometry</span>
<span class="linenr"> 2: </span><span style="color: #ccaa8f; font-weight: bold;">geometry = d2_xnitsche.in2d</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">and mesh</span>
<span class="linenr"> 5: </span><span style="color: #ccaa8f; font-weight: bold;">mesh = d2_xnitsche.vol.gz</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #99968b;">#</span><span style="color: #99968b;">load xfem-library</span>
<span class="linenr"> 8: </span><span style="color: #ccaa8f; font-weight: bold;">shared = libngsxfem_xfem                                    </span>
<span class="linenr"> 9: </span><span style="color: #ccaa8f; font-weight: bold;">shared = libngsxfem_py                                      </span>
<span class="linenr">10: </span><span style="color: #ccaa8f; font-weight: bold;">pymodule = d1_approx</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Constants, solutions and level set function</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Some simple constants are defined:
</p>
<div class="org-src-container">

<pre class="src src-pde" id="const"><span class="linenr">11: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> heapsize = 1e8
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">center of circle (domain 1)</span>
<span class="linenr">14: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> x0 = 0.1
<span class="linenr">15: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> y0 = 0
</pre>
</div>

<p>
Now, we define a specific level set function which represents the interface as its zero level.
Here, the interface is a simple circle with radius R (=0.4), i.e.
</p>
\begin{equation}
\phi(x) = \sqrt{x^2+y^2} - R
\end{equation}
<div class="org-src-container">

<pre class="src src-pde" id="lset"><span class="linenr">16: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">radius of circle (domain 1)</span>
<span class="linenr">17: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> R = 0.5
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">coefficient</span> lset
<span class="linenr">20: </span>( sqrt((x-x0)*(x-x0)+(y-y0)*(y-y0)) - R),
<span class="linenr">21: </span>
<span class="linenr">22: </span><span style="color: #e5786d;">numproc</span> draw npd -<span style="color: #e5786d;">coefficient</span>=lset -<span style="color: #cae682;">label</span>=levelset
</pre>
</div>

<p>
The reference solution is defined in order to prescribe suitable Dirichlet boundary conditions 
and to evaluate errors later.
</p>
\begin{equation}
u(x) = \left\{\begin{array}{clc} 0.5&, & \text{in } \Omega_1 \\  sin(x^2+y^2-R^2)&, & \text{in } \Omega_2 \end{array} \right.
\end{equation}
<div class="org-src-container">

<pre class="src src-pde" id="sol"><span class="linenr">23: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">henry weights</span>
<span class="linenr">24: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> bneg = 3.0
<span class="linenr">25: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> bpos = 4.0
<span class="linenr">26: </span>
<span class="linenr">27: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> aneg = 0.3
<span class="linenr">28: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> apos = 0.4
<span class="linenr">29: </span>
<span class="linenr">30: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">coefficient</span> rhspos
<span class="linenr">31: </span>1,
<span class="linenr">32: </span>
<span class="linenr">33: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">coefficient</span> rhsneg
<span class="linenr">34: </span>1,
<span class="linenr">35: </span>
<span class="linenr">36: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">coefficient</span> bndpos
<span class="linenr">37: </span>0,
<span class="linenr">38: </span>
<span class="linenr">39: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">coefficient</span> bndneg
<span class="linenr">40: </span>0,
<span class="linenr">41: </span>
<span class="linenr">42: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> lambda = 2.0
<span class="linenr">43: </span>
<span class="linenr">44: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> one = 1.0
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> (Extended) Finite element space and Gridfunction</h3>
<div class="outline-text-3" id="text-2-3">
<p>
For the extended finite element space we now also discuss two flags which exist for every finite element space in NGSolve:
</p>
<ul class="org-ul">
<li>The <a href="#coderef-dirichlet"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-dirichlet');" onmouseout="CodeHighlightOff(this, 'coderef-dirichlet');">dirichlet-flags</a> mark degrees of freedom at selected boundaries as 'known' and implements values as essential conditions
</li>
<li>The <a href="#coderef-dgjumps"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-dgjumps');" onmouseout="CodeHighlightOff(this, 'coderef-dgjumps');">dgjumps-flag</a> adds additional couplings into the matrix pattern for the discretization. This might become necessary for methods which 
involve integrals at element interfaces. In the context of extended finite elements this can be stabilization terms, e.g. the ghost penalty integrals. 
</li>
</ul>
<div class="org-src-container">

<pre class="src src-pde" id="xfespace"><span id="coderef-fescomp" class="coderef-off"><span class="linenr">45: </span><span style="color: #e5786d;">define</span><span style="color: #e5786d;"> fespace</span> fescomp</span>
<span id="coderef-fescomptype" class="coderef-off"><span class="linenr">46: </span>       -<span style="color: #cae682;">type</span>=xstd<span style="color: #e5786d;">fespace</span></span>
<span id="coderef-fesstdtype" class="coderef-off"><span class="linenr">47: </span>       -<span style="color: #cae682;">type</span>_std=h1ho</span>
<span id="coderef-fesorder" class="coderef-off"><span class="linenr">48: </span>       -<span style="color: #cae682;">order</span>=1</span>
<span id="coderef-dirichlet" class="coderef-off"><span class="linenr">49: </span>       -dirichlet=[1,2]</span>
<span id="coderef-geometryref" class="coderef-off"><span class="linenr">50: </span>       -ref_space=1</span>
<span id="coderef-empty" class="coderef-off"><span class="linenr">51: </span><span style="color: #99968b;">#       </span><span style="color: #99968b;">-empty</span></span>
<span id="coderef-dgjumps" class="coderef-off"><span class="linenr">52: </span><span style="color: #99968b;">#       </span><span style="color: #99968b;">-dgjumps</span></span>
<span class="linenr">53: </span>
<span class="linenr">54: </span><span style="color: #e5786d;">numproc</span> informxfem npix
<span class="linenr">55: </span>        -xstd<span style="color: #e5786d;">fespace</span>=fescomp
<span class="linenr">56: </span>        -coef_levelset=lset
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Gridfunction, linear and bilinear forms</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The treatment of gridfunctions and linear forms is the same as before.
</p>
<div class="org-src-container">

<pre class="src src-pde" id="comp1"><span class="linenr">57: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">gridfunction</span> u -<span style="color: #e5786d;">fespace</span>=fescomp
<span class="linenr">58: </span>
<span class="linenr">59: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">linearform</span> f -<span style="color: #e5786d;">fespace</span>=fescomp
<span class="linenr">60: </span>xsource rhsneg rhspos
</pre>
</div>
<p>
For the bilinearform, we consider new integrators, such as
</p>
<ul class="org-ul">
<li>The <a href="#coderef-laplace"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-laplace');" onmouseout="CodeHighlightOff(this, 'coderef-laplace');">xlaplace-integrator</a> which is a broken laplace-integrator w.r.t. the two domains
</li>
<li>The <a href="#coderef-xnitsche"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-xnitsche');" onmouseout="CodeHighlightOff(this, 'coderef-xnitsche');">xnitsche-integrator</a> which implements the interface condition in a weak sense
</li>
<li>( <a href="#coderef-xnitscheminstab"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-xnitscheminstab');" onmouseout="CodeHighlightOff(this, 'coderef-xnitscheminstab');">a variant of the default nitsche-formulation</a> )
</li>
<li>( An <a href="#coderef-loghostpenalty"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-loghostpenalty');" onmouseout="CodeHighlightOff(this, 'coderef-loghostpenalty');">additional stabilization</a> bilinear form )
</li>
</ul>
<div class="org-src-container">

<pre class="src src-pde" id="comp2"><span class="linenr">61: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">bilinearform</span> a -<span style="color: #e5786d;">fespace</span>=fescomp -symmetric -<span style="color: #e5786d;">linearform</span>=f
<span id="coderef-laplace" class="coderef-off"><span class="linenr">62: </span>xlaplace aneg*bneg apos*bpos</span>
<span id="coderef-xnitsche" class="coderef-off"><span class="linenr">63: </span>xnitsche_hansbo aneg apos bneg bpos lambda</span>
<span id="coderef-xnitscheminstab" class="coderef-off"><span class="linenr">64: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">xnitsche_minstab_hansbo aneg apos bneg bpos</span></span>
<span id="coderef-loghostpenalty" class="coderef-off"><span class="linenr">65: </span><span style="color: #99968b;">#</span><span style="color: #99968b;">lo_ghostpenalty aneg apos one</span></span>
</pre>
</div>
<p>
Setting boundary conditions in extended finite elements is slightly different from the methods used for 
standard finite element spaces. The corresponding function <a href="#coderef-setvaluesx"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-setvaluesx');" onmouseout="CodeHighlightOff(this, 'coderef-setvaluesx');">setvaluesx</a> needs two 
functions defined at the boundary corresponding to the restriction of the boundary to domain one (neg) 
and domain two (pos). 
</p>
<div class="org-src-container">

<pre class="src src-pde" id="comp3"><span id="coderef-setvaluesx" class="coderef-off"><span class="linenr">66: </span><span style="color: #e5786d;">numproc</span> setvaluesx npsvx -<span style="color: #e5786d;">gridfunction</span>=u -<span style="color: #e5786d;">coefficient</span>_neg=bndneg -<span style="color: #e5786d;">coefficient</span>_pos=bndpos -boundary</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Solver and Visualization</h3>
<div class="outline-text-3" id="text-2-5">
<p>
As before:
</p>
<div class="org-src-container">

<pre class="src src-pde" id="bvp"><span class="linenr">67: </span><span style="color: #99968b;">#</span><span style="color: #99968b;">define preconditioner c -type=local -bilinearform=a -test #-block</span>
<span class="linenr">68: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">preconditioner</span> c -<span style="color: #cae682;">type</span>=direct -<span style="color: #e5786d;">bilinearform</span>=a -<span style="color: #cae682;">inverse</span>=pardiso <span style="color: #99968b;">#</span><span style="color: #99968b;">-test</span>
<span class="linenr">69: </span>
<span class="linenr">70: </span><span style="color: #e5786d;">numproc</span> bvp npbvp -<span style="color: #e5786d;">gridfunction</span>=u -<span style="color: #e5786d;">bilinearform</span>=a -<span style="color: #e5786d;">linearform</span>=f -<span style="color: #cae682;">solver</span>=cg -<span style="color: #e5786d;">preconditioner</span>=c -maxsteps=1000 -prec=1e-6 
<span class="linenr">71: </span>
<span class="linenr">72: </span><span style="color: #e5786d;">numproc</span> visualization npviz -scalarfunction=u 
<span class="linenr">73: </span>    -minval=0 -maxval=0.3
<span class="linenr">74: </span>    -nolineartexture -deformationscale=1 -subdivision=4
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Things to try with the pde-file here:</h3>
<div class="outline-text-3" id="text-2-6">
<ol class="org-ol">
<li>&#x2026;
</li>
<li>&#x2026;
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Resulting files</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="d2_xnitsche.pde">d2_xnitsche.pde</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Christoph Lehrenfeld</p>
<p class="date">Created: 2015-02-15 So 22:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
